export const arDic = {
  homePage: {
    hero: {
      mainButton: "مرحبا",
      title: "أنا  ",
      titleSpan: "أحمد عبدالفتاح",
      titleBr: "مهندس وكلاء ذكاء إصطناعي",
      mainParagraph: "أحول الأفكار المعقدة إلى تطبيقات ويب سريعة، ذكية، وقابلة للتوسع باستخدام Next.js وأحدث تقنيات الـ AI مع Mastra.",
      clientServed: "عميل حالي",
      starsTitle: "+5 سنوات",
      starsTitleBr: "من الخبرة",
    },
    services: {
      title: "خدماتنا",
      description: "خدمات متكاملة لبناء تطبيقات ذكية، سريعة، ومصممة خصيصاً لنمو أعمالك.",
    },
    hireMe: {
      title: "لماذا ",
      titleSpan: "تختارني",
      titleBr: " لمشروعك القادم ؟",
      description: "أنا لا أقدم مجرد أكواد؛ أنا ابنك الذي يجمع بين الهندسة البرمجية الذكية والرؤية التسويقية التجارية. إليك كيف يمكن لخبرتي أن تحول مشروعك من فكرة إلى نجاح ملموس:",
      whyChooseMe: [
        {
          title: "1. ابتكار حلول ذكية مدعومة بالذكاء الاصطناعي (AI-Powered Innovation)",
          description: "تجاوز النمط التقليدي للتطوير. أقوم بتصميم وبناء تطبيقات ويب مستقلة باستخدام Next.js ودمج Mastra AI لإنشاء سير عمل آلي ومتقدم يرفع من تفاعل المستخدمين ويحقق أتمتة فعالة لأعمالك."
        },
        {
          title: "2. بناء منصات متكاملة عالية الأداء (Full-Stack Excellence)",
          description: "أضمن لك حلولاً برمجية متكاملة تشمل: هندسة قواعد البيانات، وتجارب مستخدم سريعة وسلسة (UX/UI)، وبنية تحتية آمنة وقابلة للتوسع. جميع الحلول مصممة لتكون متوافقة مع محركات البحث (SEO) لضمان وصول عملك لأكبر جمهور بأعلى كفاءة."
        },
        {
          title: "3. هندسة تقنية ترتكز على النتائج التجارية (Business-Driven Engineering)",
          description: "خبرتي لا تتوقف عند كتابة الكود، بل تمتد إلى فهم آليات السوق والتسويق الرقمي. هذا الفهم يسمح لي بتطوير شفرات برمجية لا تخدم فقط البناء التقني، بل هي أدوات استراتيجية مصممة خصيصاً لزيادة معدل التحويل والمبيعات (ROI) لأعمالك."
        }
      ],
    },
    technologies: {
      title: "التقنيات التي نستخدمها",
      subTitle: "التقنيات التي أعتمد عليها لبناء حلول رقمية سريعة، آمنة، وقابلة للتوسع. أدمج بين أحدث أدوات تطوير الويب وتطبيقات الذكاء الاصطناعي لضمان أعلى مستويات الأداء.",
    },
  },
  projectsPage: {
    title: "مشايعنا ",
    titleSpan: "المتكاملة",
    subTitle: "حوّل رؤيتك إلى واقع رقمي متطور. تصميمات Full-Stack ذكية مدعومة بالذكاء الاصطناعي.",

  },
}