export const arDic = {
  homePage: {
    hero: {
      mainButton: "مرحبا",
      title: "أنا  ",
      titleSpan: "أحمد عبدالفتاح",
      titleBr: "مهندس وكلاء ذكاء إصطناعي",
      mainParagraph: "أحول الأفكار المعقدة إلى تطبيقات ويب سريعة، ذكية، وقابلة للتوسع باستخدام Next.js وأحدث تقنيات الـ AI مع Mastra.",
      clientServed: "عميل حالي",
      starsTitle: "+5 سنوات",
      starsTitleBr: "من الخبرة",
    },
    services: {
      title: "خدماتنا",
      description: "خدمات متكاملة لبناء تطبيقات ذكية، سريعة، ومصممة خصيصاً لنمو أعمالك.",
    },
    hireMe: {
      title: "ما الذي يدفعك ",
      titleSpan: "لتعييني في",
      titleBr: "مشروعاتك القادمة؟",
      whyChooseMe: [
        {
          title: "تطبيقات ذكية مدعومة بالـ AI",
          description: "لا أبني مجرد مواقع تقليدية، بل أطور تطبيقات ويب ذكية ومستقلة باستخدام Next.js و Mastra AI لأتمتة سير العمل ورفع تفاعل المستخدمين."
        },
        {
          title: "كفاءة ومسؤولية برمجية متكاملة",
          description: "من بناء وهندسة قواعد البيانات إلى تقديم تجارب مستخدم سلسة وسريعة؛ أضمن لك حلول Full-Stack عالية الأداء، متوافقة مع محركات البحث (SEO)، وبنية تحتية برمجية آمنة."
        },
        {
          title: "هندسة برمجية برؤية تجارية",
          description: "بفضل خلفيتي في التسويق الرقمي وفهمي العميق لآليات السوق، أكتب كوداً يخدم أهداف بيزنسك مباشرة، ويزيد من معدل التحويل والمبيعات (ROI)."
        }
      ],
    },
  }
}