import { CircleDollarSign, ClipboardPenLine, Workflow } from "lucide-react"

export const arDic = {
  homePage: {
    heroSection: {
      title: "رسم فاخر",
      titleBr: "التصميم الداخلي",
      subTitle: "حوّل منزل أحلامك إلى حقيقة مع خدمات التصميم الداخلي الفردية",
      mainButtonTitle: "ابدأ الآن",
      secondaryButtonTitle: "اتصل بنا"
    }
  },
  whatWeProvide: {
    title: "ما نقدمه",
    subTitle: "نقدم مجموعة واسعة من خدمات التصميم الداخلي لتلبية احتياجاتك.",
    cards: [
      {
        title: "رفاهية",
        titleBr: "مرافق",
        paragraph: "تتمثل ميزة استئجار مساحة عمل معنا في أنها توفر لك خدمات مريحة.",
        icon: ClipboardPenLine,
        latency: .4
      },
      {
        title: "بسعر ",
        titleBr: "معقول",
        paragraph: "يمكنك الحصول على مساحة عمل عالية الجودة بسعر معقول.",
        icon: CircleDollarSign,
        latency: .6
      },
      {
        title: "سير العمل",
        titleBr: "سلس",
        paragraph: "نحن نوفر أسهل وأسرع عملية تصميم داخلي واقعية وسهلة التنفيذ.",
        icon: Workflow,
        latency: .8
      },
    ]
  },
  banner: {
    title: "طريقة بسيطة لإنشاء غرفة معيشة أنيقة",
    subTitle: "حقق حلمك بمنزل مثالي من خلال مساعدة فردية في التصميم الداخلي ومنتجات مختارة بعناية بألوان تناسب ذوقك ومساحتك وميزانيتك.",
  },
  banner2: {
    title: "نحن نؤمن بأن العمل الجماعي يُحسّن أي مشروع.",
    subTitle: "حقق حلمك بمنزل مثالي من خلال مساعدة فردية في التصميم الداخلي ومنتجات مختارة بعناية بألوان تناسب ذوقك ومساحتك وميزانيتك.",
    details: [
      {
        number: 15,
        text: "سنة من",
        textBr: "الخبرة",
        latency: .5
      },
      {
        number: 38,
        text: "مشروع",
        textBr: "تم تنفيذه",
        latency: .7
      },
      {
        number: 19,
        text: "مدينة",
        textBr: "مختلفة",
        latency: .9
      },
    ]
  },
  testimonial: {
    title: "كلمات من عملائنا",
    subTitle: "حقق حلمك بمنزل مثالي من خلال مساعدة فردية في التصميم الداخلي ومنتجات مختارة بعناية بألوان تناسب ذوقك وميزانيتك.",
    TestimonialData:
      [
        {
          id: 1,
          name: "أحمد محمد",
          job: "مصمم ديكور",
          img: "https://i.pravatar.cc/300?img=1",
          text: "ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. ",
          delay: 0.2,
          backgroundColor: "black"
        },
        {
          id: 2,
          name: "دعاء أحمد",
          job: "مبرمجة",
          img: "https://i.pravatar.cc/300?img=5",
          text: "ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. ",
          delay: 0.4,
          backgroundColor: "white"

        },
        {
          id: 3,
          name: "محمود أحمد",
          job: "مدير مشروعات",
          img: "https://i.pravatar.cc/300?img=3",
          text: "ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. ",
          delay: 0.6,
          backgroundColor: "black"

        },
      ]
  },
  subscribe: {
    title: "اشترك في نشرتنا الإخبارية",
    subTitle: "سجل في نشرتنا الاخبارية ليصلك كل جديد.",
  },
}