export const testimonialData = [
  {
    sentence: "بصراحة تجربة ممتازة، الكنبة اللي اشتريتها خامتها تحفة والتشطيب أنضف بكتير من الصور، والتعامل كان في منتهى الذوق والالتزام بالمواعيد.بجد أنصح اي حد يجربها .",
    avatar: "/images/person1.webp",
    name: "أحمد عبد العزيز",
    job: "مهندس ديكور",
  },
  {
    sentence: "كنت خايفة أطلب أونلاين بس فعلاً حاجتكم تشرف. الألوان طالعة مظبوطة بالظبط زي ما كنت متخيلة، والتقفيل بجد ينافس البراندات العالمية .",
    avatar: "/images/person2.webp",
    name: "سارة محمود",
    job: "صانعة محتوى",
  },
  {
    sentence: "اشتريت طقم ليفينج كامل، الماتريال ممتازة ومريحة جداً في القعدة. أحلى حاجة إنهم فاهمين في التفاصيل وبيساعدوك تختار اللي يليق على مساحة بيتك .",
    avatar: "/images/person3.webp",
    name: "محمد حسن",
    job: "مدير مبيعات",
  }
]